constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          57020;
        startFace       56650;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          193;
        startFace       113670;
    }
    cylinderWalls
    {
        type            patch;
        physicalType    patch;
        nFaces          221;
        startFace       113863;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          193;
        startFace       114084;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          44;
        startFace       114277;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          89;
        startFace       114321;
    }
)

// ************************************************************************* //
