system/probesPrim
probesPrim

{

 functionObjectLibs ( "libsampling.so");
 
 type probes;

 name probes;
 
 writeControl runTime;

 writeInterval 0.25;
 
 fields
 (

          U

          p

 );


 probeLocations
  (

    (1.0 0.0 0) // behind the cylinder
    (10 2.5 0) // in the wake 

  );


  }
